In [2]:
import pandas as pd

In [3]:
notas = pd.DataFrame({
    'nome':['João','Maria','José','Alice'],
    'idade':[20,21,19,20],
    'nota_final':[5.0,10.0,6.0,10.0]
})
notas

    nome  idade  nota_final
0   João     20         5.0
1  Maria     21        10.0
2   José     19         6.0
3  Alice     20        10.0

In [6]:
notas.sort_values(by = 'nota_final')

    nome  idade  nota_final
0   João     20         5.0
2   José     19         6.0
1  Maria     21        10.0
3  Alice     20        10.0

In [7]:
notas.sort_values(by = 'nota_final',ascending=False)

    nome  idade  nota_final
1  Maria     21        10.0
3  Alice     20        10.0
2   José     19         6.0
0   João     20         5.0

In [11]:
notas.sort_values(by=['nota_final','nome'],ascending=[False,True],inplace=True)

In [12]:
notas

    nome  idade  nota_final
3  Alice     20        10.0
1  Maria     21        10.0
2   José     19         6.0
0   João     20         5.0